frontend/src/test/frontend-load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60  # Test for 60 seconds
      arrivalRate: 20  # Simulate 20 users per second
  defaults:
    headers:
      User-Agent: "Artillery-Frontend-Test"

scenarios:
  - flow:
      - get:
          url: "/"  # Home page
      - think: 2
      - get:
          url: "/Quests"  
      - think: 1
      - get:
          url: "/Chat"